SmartQuizZApp/QuestionAnalisys/Web References/Racai/ttlws.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:impl="http://ws.racai.ro/pdk/ttlws" xmlns:wsdlsoap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns1="http://ws.racai.ro/pdk/ttlws" targetNamespace="http://ws.racai.ro/pdk/ttlws" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <wsdl:types />
  <wsdl:message name="SentenceSplitterRequest">
    <wsdl:part name="lang" type="xsd:string">
      <wsdl:documentation>The language of the engine to use.</wsdl:documentation>
    </wsdl:part>
    <wsdl:part name="instr" type="xsd:string">
      <wsdl:documentation>The input paragraph or sentence string (must be SGML encoded).</wsdl:documentation>
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="SentenceSplitterResponse">
    <wsdl:part name="SentenceSplitterReturn" type="xsd:string">
      <wsdl:documentation>This method returs a set of sentences as a single string. The sentences are separated by '\r\n'.</wsdl:documentation>
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="TokenizerRequest">
    <wsdl:part name="lang" type="xsd:string">
      <wsdl:documentation>The language of the engine to use.</wsdl:documentation>
    </wsdl:part>
    <wsdl:part name="instr" type="xsd:string">
      <wsdl:documentation>One input sentence string from SentenceSplitter.</wsdl:documentation>
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="TokenizerResponse">
    <wsdl:part name="TokenizerReturn" type="xsd:string">
      <wsdl:documentation>The method returns a set of lines separated by '\r\n'. Each line contains a token and possibly a POS tag (list) separated by '\t' and a NER tag (list) separated by '\t'.</wsdl:documentation>
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="TaggerRequest">
    <wsdl:part name="lang" type="xsd:string">
      <wsdl:documentation>The language of the engine to use.</wsdl:documentation>
    </wsdl:part>
    <wsdl:part name="instr" type="xsd:string">
      <wsdl:documentation>One input tokenized sentence string from Tokenizer.</wsdl:documentation>
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="TaggerResponse">
    <wsdl:part name="TaggerReturn" type="xsd:string">
      <wsdl:documentation>The method returns a set of lines separated by '\r\n'. Each line contains a token and a POS tag (list) separated by '\t'. Possibly, also a NER tag (list) separated by '\t'.</wsdl:documentation>
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="LemmatizerRequest">
    <wsdl:part name="lang" type="xsd:string">
      <wsdl:documentation>The language of the engine to use.</wsdl:documentation>
    </wsdl:part>
    <wsdl:part name="instr" type="xsd:string">
      <wsdl:documentation>One input tokenized and tagged sentence string from Tagger.</wsdl:documentation>
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="LemmatizerResponse">
    <wsdl:part name="LemmatizerReturn" type="xsd:string">
      <wsdl:documentation>The method returns a set of lines separated by '\r\n'. Each line contains a token, a POS tag (list) and a lemma, all separated by '\t'.</wsdl:documentation>
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="ChunkerRequest">
    <wsdl:part name="lang" type="xsd:string">
      <wsdl:documentation>The language of the engine to use.</wsdl:documentation>
    </wsdl:part>
    <wsdl:part name="instr" type="xsd:string">
      <wsdl:documentation>One input tokenized, tagged and lemmatized sentence string from Lemmatizer.</wsdl:documentation>
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="ChunkerResponse">
    <wsdl:part name="ChunkerReturn" type="xsd:string">
      <wsdl:documentation>The method returns a set of lines separated by '\r\n'. Each line contains a token, a POS tag (list), a lemma and possibly a list of available chunks to which the current token belongs, all separated by '\t'.</wsdl:documentation>
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="XCESRequest">
    <wsdl:part name="lang" type="xsd:string">
      <wsdl:documentation>The language of the engine to use.</wsdl:documentation>
    </wsdl:part>
    <wsdl:part name="parid" type="xsd:string">
      <wsdl:documentation>The paragraph id. If equals to '', no paragraph id is inserted.</wsdl:documentation>
    </wsdl:part>
    <wsdl:part name="instr" type="xsd:string">
      <wsdl:documentation>The input string as a paragraph or sequence of sentences.</wsdl:documentation>
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="XCESResponse">
    <wsdl:part name="XCESReturn" type="xsd:string">
      <wsdl:documentation>The method returns a set of &lt;seg...&gt;&lt;/seg&gt; segments containing XCES (RACAI variant) data all separated by '\r\n'.</wsdl:documentation>
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="UTF8toSGMLRequest">
    <wsdl:part name="instr" type="xsd:string">
      <wsdl:documentation>The UTF8 encoded, input string.</wsdl:documentation>
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="UTF8toSGMLResponse">
    <wsdl:part name="UTF8toSGMLReturn" type="xsd:string">
      <wsdl:documentation>The method returns a SGML character expansion of the input string.</wsdl:documentation>
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="SGMLtoUTF8Request">
    <wsdl:part name="instr" type="xsd:string">
      <wsdl:documentation>The SGML encoded, input string.</wsdl:documentation>
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="SGMLtoUTF8Response">
    <wsdl:part name="SGMLtoUTF8Return" type="xsd:string">
      <wsdl:documentation>The method returns the UTF8 character encoding of the input string.</wsdl:documentation>
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="SGMLtoUTF7Request">
    <wsdl:part name="instr" type="xsd:string">
      <wsdl:documentation>The SGML encoded, input string.</wsdl:documentation>
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="SGMLtoUTF7Response">
    <wsdl:part name="SGMLtoUTF7Return" type="xsd:string">
      <wsdl:documentation>The method returns a UTF7 representation of the input string.</wsdl:documentation>
    </wsdl:part>
  </wsdl:message>
  <wsdl:portType name="pdkTtlwsHandler">
    <wsdl:operation name="SentenceSplitter" parameterOrder="lang instr">
      <wsdl:documentation>This method performs sentence splitting. Input string must be SGML encoded. For this purpose, use this package UTF8toSGML and then apply SGMLtoUTF8 on the result value to obtain the UTF8 encoding of the result.</wsdl:documentation>
      <wsdl:input name="SentenceSplitterRequest" message="tns1:SentenceSplitterRequest" />
      <wsdl:output name="SentenceSplitterResponse" message="tns1:SentenceSplitterResponse" />
    </wsdl:operation>
    <wsdl:operation name="Tokenizer" parameterOrder="lang instr">
      <wsdl:documentation>This method performs sentence splitting. Input string must be SGML encoded. For this purpose, use this package UTF8toSGML and then apply SGMLtoUTF8 on the result value to obtain the UTF8 encoding of the result.</wsdl:documentation>
      <wsdl:input name="TokenizerRequest" message="tns1:TokenizerRequest" />
      <wsdl:output name="TokenizerResponse" message="tns1:TokenizerResponse" />
    </wsdl:operation>
    <wsdl:operation name="Tagger" parameterOrder="lang instr">
      <wsdl:documentation>This method performs POS tagging using HMM models. Input string must be SGML encoded. For this purpose, use this package UTF8toSGML and then apply SGMLtoUTF8 on the result value to obtain the UTF8 encoding of the result.</wsdl:documentation>
      <wsdl:input name="TaggerRequest" message="tns1:TaggerRequest" />
      <wsdl:output name="TaggerResponse" message="tns1:TaggerResponse" />
    </wsdl:operation>
    <wsdl:operation name="Lemmatizer" parameterOrder="lang instr">
      <wsdl:documentation>This method performs lemmatization using lexicon lookup and statistical lemmatization. Input string must be SGML encoded. For this purpose, use this package UTF8toSGML and then apply SGMLtoUTF8 on the result value to obtain the UTF8 encoding of the result.</wsdl:documentation>
      <wsdl:input name="LemmatizerRequest" message="tns1:LemmatizerRequest" />
      <wsdl:output name="LemmatizerResponse" message="tns1:LemmatizerResponse" />
    </wsdl:operation>
    <wsdl:operation name="Chunker" parameterOrder="lang instr">
      <wsdl:documentation>This method performs chunking over sequences of POS tags defined by regexes. Input string must be SGML encoded. For this purpose, use this package UTF8toSGML and then apply SGMLtoUTF8 on the result value to obtain the UTF8 encoding of the result.</wsdl:documentation>
      <wsdl:input name="ChunkerRequest" message="tns1:ChunkerRequest" />
      <wsdl:output name="ChunkerResponse" message="tns1:ChunkerResponse" />
    </wsdl:operation>
    <wsdl:operation name="XCES" parameterOrder="lang parid instr">
      <wsdl:documentation>This method performs XCES encoding on the input string and calls all the processing methods in order. Input string must be SGML encoded. For this purpose, use this package UTF8toSGML and then apply SGMLtoUTF8 on the result value to obtain the UTF8 encoding of the result.</wsdl:documentation>
      <wsdl:input name="XCESRequest" message="tns1:XCESRequest" />
      <wsdl:output name="XCESResponse" message="tns1:XCESResponse" />
    </wsdl:operation>
    <wsdl:operation name="UTF8toSGML" parameterOrder="instr">
      <wsdl:documentation>This static method performs UTF8 to SGML encoding on the input string.</wsdl:documentation>
      <wsdl:input name="UTF8toSGMLRequest" message="tns1:UTF8toSGMLRequest" />
      <wsdl:output name="UTF8toSGMLResponse" message="tns1:UTF8toSGMLResponse" />
    </wsdl:operation>
    <wsdl:operation name="SGMLtoUTF8" parameterOrder="instr">
      <wsdl:documentation>This static method performs SGML to UTF8 encoding on the input string.</wsdl:documentation>
      <wsdl:input name="SGMLtoUTF8Request" message="tns1:SGMLtoUTF8Request" />
      <wsdl:output name="SGMLtoUTF8Response" message="tns1:SGMLtoUTF8Response" />
    </wsdl:operation>
    <wsdl:operation name="SGMLtoUTF7" parameterOrder="instr">
      <wsdl:documentation>This static method performs SGML to UTF7 encoding on the input string.</wsdl:documentation>
      <wsdl:input name="SGMLtoUTF7Request" message="tns1:SGMLtoUTF7Request" />
      <wsdl:output name="SGMLtoUTF7Response" message="tns1:SGMLtoUTF7Response" />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="pdkTtlwsSoapBinding" type="tns1:pdkTtlwsHandler">
    <wsdlsoap:binding transport="http://schemas.xmlsoap.org/soap/http" style="rpc" />
    <wsdl:operation name="SentenceSplitter">
      <wsdlsoap:operation soapAction="http://ws.racai.ro/pdk/ttlws#SentenceSplitter" />
      <wsdl:input name="SentenceSplitterRequest">
        <wsdlsoap:body use="encoded" namespace="http://ws.racai.ro/pdk/ttlws" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" />
      </wsdl:input>
      <wsdl:output name="SentenceSplitterResponse">
        <wsdlsoap:body use="encoded" namespace="http://ws.racai.ro/pdk/ttlws" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" />
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="Tokenizer">
      <wsdlsoap:operation soapAction="http://ws.racai.ro/pdk/ttlws#Tokenizer" />
      <wsdl:input name="TokenizerRequest">
        <wsdlsoap:body use="encoded" namespace="http://ws.racai.ro/pdk/ttlws" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" />
      </wsdl:input>
      <wsdl:output name="TokenizerResponse">
        <wsdlsoap:body use="encoded" namespace="http://ws.racai.ro/pdk/ttlws" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" />
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="Tagger">
      <wsdlsoap:operation soapAction="http://ws.racai.ro/pdk/ttlws#Tagger" />
      <wsdl:input name="TaggerRequest">
        <wsdlsoap:body use="encoded" namespace="http://ws.racai.ro/pdk/ttlws" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" />
      </wsdl:input>
      <wsdl:output name="TaggerResponse">
        <wsdlsoap:body use="encoded" namespace="http://ws.racai.ro/pdk/ttlws" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" />
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="Lemmatizer">
      <wsdlsoap:operation soapAction="http://ws.racai.ro/pdk/ttlws#Lemmatizer" />
      <wsdl:input name="LemmatizerRequest">
        <wsdlsoap:body use="encoded" namespace="http://ws.racai.ro/pdk/ttlws" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" />
      </wsdl:input>
      <wsdl:output name="LemmatizerResponse">
        <wsdlsoap:body use="encoded" namespace="http://ws.racai.ro/pdk/ttlws" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" />
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="Chunker">
      <wsdlsoap:operation soapAction="http://ws.racai.ro/pdk/ttlws#Chunker" />
      <wsdl:input name="ChunkerRequest">
        <wsdlsoap:body use="encoded" namespace="http://ws.racai.ro/pdk/ttlws" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" />
      </wsdl:input>
      <wsdl:output name="ChunkerResponse">
        <wsdlsoap:body use="encoded" namespace="http://ws.racai.ro/pdk/ttlws" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" />
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="XCES">
      <wsdlsoap:operation soapAction="http://ws.racai.ro/pdk/ttlws#XCES" />
      <wsdl:input name="XCESRequest">
        <wsdlsoap:body use="encoded" namespace="http://ws.racai.ro/pdk/ttlws" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" />
      </wsdl:input>
      <wsdl:output name="XCESResponse">
        <wsdlsoap:body use="encoded" namespace="http://ws.racai.ro/pdk/ttlws" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" />
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="UTF8toSGML">
      <wsdlsoap:operation soapAction="http://ws.racai.ro/pdk/ttlws#UTF8toSGML" />
      <wsdl:input name="UTF8toSGMLRequest">
        <wsdlsoap:body use="encoded" namespace="http://ws.racai.ro/pdk/ttlws" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" />
      </wsdl:input>
      <wsdl:output name="UTF8toSGMLResponse">
        <wsdlsoap:body use="encoded" namespace="http://ws.racai.ro/pdk/ttlws" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" />
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="SGMLtoUTF8">
      <wsdlsoap:operation soapAction="http://ws.racai.ro/pdk/ttlws#SGMLtoUTF8" />
      <wsdl:input name="SGMLtoUTF8Request">
        <wsdlsoap:body use="encoded" namespace="http://ws.racai.ro/pdk/ttlws" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" />
      </wsdl:input>
      <wsdl:output name="SGMLtoUTF8Response">
        <wsdlsoap:body use="encoded" namespace="http://ws.racai.ro/pdk/ttlws" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" />
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="SGMLtoUTF7">
      <wsdlsoap:operation soapAction="http://ws.racai.ro/pdk/ttlws#SGMLtoUTF7" />
      <wsdl:input name="SGMLtoUTF7Request">
        <wsdlsoap:body use="encoded" namespace="http://ws.racai.ro/pdk/ttlws" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" />
      </wsdl:input>
      <wsdl:output name="SGMLtoUTF7Response">
        <wsdlsoap:body use="encoded" namespace="http://ws.racai.ro/pdk/ttlws" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="TTL">
    <wsdl:port name="TTLWS" binding="tns1:pdkTtlwsSoapBinding">
      <wsdlsoap:address location="http://ws.racai.ro:8080/pdk/ttlws" />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>